



BFCPbis Working Group                                       G. Camarillo
Internet-Draft                                                  Ericsson
Obsoletes: 4583 (if approved)                              T. Kristensen
Intended status: Standards Track                                   Cisco
Expires: March 30, 2019                                      C. Holmberg
                                                                Ericsson
                                                      September 26, 2018


   Session Description Protocol (SDP) Format for Binary Floor Control
                        Protocol (BFCP) Streams
                    draft-ietf-bfcpbis-rfc4583bis-25

Abstract

   This document defines the Session Description Protocol (SDP) offer/
   answer procedures for negotiating and establishing Binary Floor
   Control Protocol (BFCP) streams.

   This document obsoletes RFC 4583.  Changes from RFC 4583 are
   summarized in Section 14.

Status of This Memo

   This Internet-Draft is submitted in full conformance with the
   provisions of BCP 78 and BCP 79.

   Internet-Drafts are working documents of the Internet Engineering
   Task Force (IETF).  Note that other groups may also distribute
   working documents as Internet-Drafts.  The list of current Internet-
   Drafts is at http://datatracker.ietf.org/drafts/current/.

   Internet-Drafts are draft documents valid for a maximum of six months
   and may be updated, replaced, or obsoleted by other documents at any
   time.  It is inappropriate to use Internet-Drafts as reference
   material or to cite them other than as "work in progress."

   This Internet-Draft will expire on March 30, 2019.

Copyright Notice

   Copyright (c) 2018 IETF Trust and the persons identified as the
   document authors.  All rights reserved.

   This document is subject to BCP 78 and the IETF Trust's Legal
   Provisions Relating to IETF Documents
   (http://trustee.ietf.org/license-info) in effect on the date of
   publication of this document.  Please review these documents



Camarillo, et al.        Expires March 30, 2019                 [Page 1]

Internet-Draft                    BFCP                    September 2018


   carefully, as they describe your rights and restrictions with respect
   to this document.  Code Components extracted from this document must
   include Simplified BSD License text as described in Section 4.e of
   the Trust Legal Provisions and are provided without warranty as
   described in the Simplified BSD License.

Table of Contents

   1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   2
   2.  Conventions . . . . . . . . . . . . . . . . . . . . . . . . .   3
   3.  Floor Control Roles . . . . . . . . . . . . . . . . . . . . .   3
   4.  Fields in the 'm' Line  . . . . . . . . . . . . . . . . . . .   4
   5.  SDP Attributes  . . . . . . . . . . . . . . . . . . . . . . .   5
     5.1.  SDP 'floorctrl' Attribute . . . . . . . . . . . . . . . .   5
     5.2.  SDP 'confid' and 'userid' Attributes  . . . . . . . . . .   7
     5.3.  SDP 'floorid' Attribute . . . . . . . . . . . . . . . . .   7
     5.4.  SDP 'bfcpver' Attribute . . . . . . . . . . . . . . . . .   8
   6.  Multiplexing Considerations . . . . . . . . . . . . . . . . .   9
   7.  BFCP Connection Management  . . . . . . . . . . . . . . . . .  10
     7.1.  TCP Connection Management . . . . . . . . . . . . . . . .  10
   8.  TLS/DTLS Considerations . . . . . . . . . . . . . . . . . . .  11
   9.  ICE Considerations  . . . . . . . . . . . . . . . . . . . . .  11
   10. SDP Offer/Answer Procedures . . . . . . . . . . . . . . . . .  12
     10.1.  Generating the Initial SDP Offer . . . . . . . . . . . .  13
     10.2.  Generating the SDP Answer  . . . . . . . . . . . . . . .  13
     10.3.  Offerer Processing of the SDP Answer . . . . . . . . . .  14
     10.4.  Modifying the Session  . . . . . . . . . . . . . . . . .  15
   11. Examples  . . . . . . . . . . . . . . . . . . . . . . . . . .  15
   12. Security Considerations . . . . . . . . . . . . . . . . . . .  17
   13. IANA Considerations . . . . . . . . . . . . . . . . . . . . .  17
     13.1.  Registration of SDP 'proto' Values . . . . . . . . . . .  17
     13.2.  Registration of the SDP 'floorctrl' Attribute  . . . . .  18
     13.3.  Registration of the SDP 'confid' Attribute . . . . . . .  18
     13.4.  Registration of the SDP 'userid' Attribute . . . . . . .  18
     13.5.  Registration of the SDP 'floorid' Attribute  . . . . . .  18
     13.6.  Registration of the SDP 'bfcpver' Attribute  . . . . . .  18
   14. Changes from RFC 4583 . . . . . . . . . . . . . . . . . . . .  19
   15. Acknowledgements  . . . . . . . . . . . . . . . . . . . . . .  20
   16. References  . . . . . . . . . . . . . . . . . . . . . . . . .  20
     16.1.  Normative References . . . . . . . . . . . . . . . . . .  20
     16.2.  Informational References . . . . . . . . . . . . . . . .  22
   Authors' Addresses  . . . . . . . . . . . . . . . . . . . . . . .  22

1.  Introduction

   As discussed in the BFCP (Binary Floor Control Protocol)
   specification [I-D.ietf-bfcpbis-rfc4582bis], a given BFCP client
   needs a set of data in order to establish a BFCP connection to a



Camarillo, et al.        Expires March 30, 2019                 [Page 2]

Internet-Draft                    BFCP                    September 2018


   floor control server.  This data includes the transport address of
   the server, the conference identifier, and the user identifier.

   One way for clients to obtain this information is to use an SDP
   offer/answer [RFC3264] exchange.  This document specifies how to
   encode this information in the SDP session descriptions that are part
   of such an offer/answer exchange.

   User agents typically use the offer/answer model to establish a
   number of media streams of different types.  Following this model, a
   BFCP connection is described as any other media stream by using an
   SDP 'm' line, possibly followed by a number of SDP lines that also
   apply to the BFCP connection.

   Section 4 defines how the field values in 'm' line representing a
   BFCP connection are set.

   Section 5 defines SDP attributes that are used when negotiating a
   BFCP connection.

   Section 6 defines multiplexing considerations for a BFCP connection.

   Section 7 defines procedures for managing a BFCP connection.

   Section 8 defines TLS and DTLS considerations when negotiating a BFCP
   connection.

   Section 9 defines the Interactive Connectivity Establishment (ICE)
   [RFC8445] considerations when negotiating a BFCP connection.

   Section 10 defines the SDP offer/answer procedures for negotiating a
   BFCP connection.

2.  Conventions

   The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT",
   "SHOULD", "SHOULD NOT", "RECOMMENDED", "NOT RECOMMENDED", "MAY", and
   "OPTIONAL" in this document are to be interpreted as described in BCP
   14 [RFC2119] [RFC8174] when, and only when, they appear in all
   capitals, as shown here.

3.  Floor Control Roles

   When two endpoints establish a BFCP stream, they need to determine
   which of them acts as a floor control client and which acts as a
   floor control server.  Typically, a client that establishes a BFCP
   stream with a conference server will act as a floor control client,
   while the conference server will act as a floor control server.



Camarillo, et al.        Expires March 30, 2019                 [Page 3]

Internet-Draft                    BFCP                    September 2018


   Once the roles have been determines, the roles will apply to all
   BFCP-controlled streams associated with the BFCP stream.

4.  Fields in the 'm' Line

   This section describes how to generate an 'm' line for a BFCP stream.

   According to the SDP specification [RFC4566], the 'm' line format is
   the following:

      m=<media> <port> <proto> <fmt> ...

   The media field MUST have a value of "application".

   The port field is set depending on the value of the proto field, as
   explained below.  A port field value of zero has the standard SDP
   meaning (i.e., rejection of the media stream) regardless of the proto
   field.

      When TCP is used as the transport, the port field is set following
      the rules in [RFC4145].  Depending on the value of the 'setup'
      attribute (discussed in Section 7.1), the port field contains the
      port to which the remote endpoint will direct BFCP messages, or in
      the case where the endpoint will initiate the connection towards
      the remote endpoint, should be set to a value of 9.

      When UDP is used as the transport, the port field contains the
      port to which the remote endpoint will direct BFCP messages
      regardless of the value of the 'setup' attribute.

   This document defines five values for the proto field: TCP/BFCP,
   TCP/DTLS/BFCP, TCP/TLS/BFCP, UDP/BFCP, and UDP/TLS/BFCP.

   The proto value are used as described below:

      'TCP/BFCP' is used for TCP transport of BFCP without TLS
      encryption, and is backward compatible with RFC 4583 compliant
      endpoints.

      'TCP/TLS/BFCP' is used for TCP transport of BFCP with TLS
      encryption, and is backward interoperability with RFC 4583
      compliant endpoints that support TLS.

      'UDP/BFCP' is used for UDP transport of BFCP without DTLS
      encryption [RFC6347].

      'UDP/TLS/BFCP' is used for UDP transport of BFCP with DTLS
      encryption.  This is one of the options when ICE is used



Camarillo, et al.        Expires March 30, 2019                 [Page 4]

Internet-Draft                    BFCP                    September 2018


      (Section 9).  It can also be used without ICE when backward
      compatibility with RFC 4583 compliant endpoints is not required.

      'TCP/DTLS/BFCP' is used for TCP transport of BFCP with DTLS
      encryption, running on top of TCP using the framing method defined
      in [RFC4571]. with DTLS packets being sent and received instead of
      RTP/RTCP packets using the shim defined in RFC 4571 such that the
      length field defined in RFC 4571 precedes each DTLS message.  This
      is one of the options when ICE is used (Section 9).  It can also
      be used without ICE when backward compatibility with RFC 4583
      compliant endpoints is not required.

   The fmt (format) list is not applicable to BFCP.  The fmt list of 'm'
   lines in the case of any proto field value related to BFCP MUST
   contain a single "*" character.  If the the fmt list contains any
   other value it is ignored.

   The following is an example of an 'm' line for a BFCP connection:

      m=application 50000 TCP/TLS/BFCP *

5.  SDP Attributes

5.1.  SDP 'floorctrl' Attribute

   This section defines the SDP 'floorctrl' media-level attribute.  The
   attribute is used to determine the floor control roles (client and
   server) for the endpoints associated with the BFCP stream.

         Attribute Name: floorctrl

         Attribute Value: floor-control

         Usage Level: media

         Charset Dependent: No

         Mux Category: TBD

       The Augmented BNF syntax [RFC5234] for the attribute is:

         floor-control = role *(SP role)
         role = "c-only" / "s-only" / "c-s"

   An endpoint includes the attribute to indicate the role(s) it would
   be willing to perform for the BFCP-controlled media streams:

   c-only:  The endpoint is willing to act as floor control client.



Camarillo, et al.        Expires March 30, 2019                 [Page 5]

Internet-Draft                    BFCP                    September 2018


   s-only:  The endpoint is willing to act as floor control server only.

   When inserted in an offer, the offerer MAY indicate multiple
   attribute values ("c-only" and "s-only").  When inserted in an
   answer, the answerer MUST indicate only one attribute value: "c-only"
   or "s-only".  The offerer indicates which floor control role(s) that
   it is willing to take.  The answerer indicates the role taken by the
   answerer.  Based on this, the floor control role of the offerer is
   determined, as shown in Table 1.

                          +---------+----------+
                          | Offerer | Answerer |
                          +---------+----------+
                          |  c-only |  s-only  |
                          |  s-only |  c-only  |
                          |   c-s   |  c-only  |
                          |   c-s   |  s-only  |
                          +---------+----------+

                              Table 1: Roles

   In [RFC4583], there was a third attribute specified, "c-s", which
   meant that an endpoint was willing to act as both floor control
   client and floor control server at the same time for the BFCP stream,
   taking different roles for different BFCP-controlled media streams.
   The feature was underspecified and implemented in different ways, in
   particular many implementations interpreted "c-s" to mean that the
   endpoint is willing to act as either client or server (equivalent to
   "c-only s-only").  An implementation compliant to this specification
   MUST NOT include the "c-s" floorctl attribute value in an offer or or
   answer, but MUST accept the attribute value in offer and process it
   as equivalent to "c-only s-only" (or "s-only c-only").  As as a
   result, each endpoint will take the same role for each BFCP-
   controlled media stream assocaited with the BFCP stream.

   Endpoints compliant with [RFC4583] might not include the 'floorctrl'
   attribute in offers and answerer.  If the 'floorctrl' attribute is
   not present the offerer will act as floor control client, and the
   answerer will act as floor control server.

   The SDP Offer/Answer procedures for the 'floorctrl' attribute are
   defined in Section 10.

   The following is an example of a 'floorctrl' attribute in an offer:

             a=floorctrl:c-only s-only





Camarillo, et al.        Expires March 30, 2019                 [Page 6]

Internet-Draft                    BFCP                    September 2018


5.2.  SDP 'confid' and 'userid' Attributes

   This section defines the SDP 'confid' and the 'userid' media-level
   attributes.  The attributes are used by a floor control server to
   convey the conference ID value and user ID value to the floor control
   client, using decimal integer representation.

         Attribute Name: confid

         Attribute Value: conference-id

         Usage Level: media

         Charset Dependent: No

         Mux Category: TBD

       The Augmented BNF syntax [RFC5234] for the attribute is:

         conference-id = 1*DIGIT

         ;DIGIT is defined in [RFC5234]

         Attribute Name: userid

         Attribute Value: user-id

         Usage Level: media

         Charset Dependent: No

         Mux Category: TBD

       The Augmented BNF syntax [RFC5234] for the attribute is:

         user-id = 1*DIGIT

         ;DIGIT is defined in [RFC5234]

   The SDP Offer/Answer procedures for the 'confid' and 'userid'
   attributes are defined in Section 10.

5.3.  SDP 'floorid' Attribute

   This section defines the SDP 'floorid' media-level attribute.  The
   attribute conveys a floor identifier, and optionally pointers to one
   or more BFCP-controlled media streams.




Camarillo, et al.        Expires March 30, 2019                 [Page 7]

Internet-Draft                    BFCP                    September 2018


         Attribute Name: floorid

         Attribute Value: floor-id

         Usage Level: media

         Charset Dependent: No

         Mux Category: TBD

       The Augmented BNF syntax [RFC5234] for the attribute is:

         floor-id = "a=floorid:" 1*DIGIT SP "mstrm:" token *(SP token)

         ;DIGIT is defined in [RFC5234]
         ;token is defined in [RFC4566]

   The floor identifier value is the integer representation of the Floor
   ID to be used in BFCP.  Each media stream pointer value is associated
   with an SDP 'label' attribute [RFC4574] of a media stream.

   The SDP Offer/Answer procedures for the 'floorid' attribute are
   defined in Section 10.

      Note: In [RFC4583] 'm-stream' was erroneously used in Section 11.
      Although the example was non-normative, it is implemented by some
      vendors and occurs in cases where the endpoint is willing to act
      as a server.  Therefore, it is RECOMMENDED to support parsing and
      interpreting 'm-stream' the same way as 'mstrm' when receiving.

5.4.  SDP 'bfcpver' Attribute

   This section defines the SDP 'bfcpver' media-level attribute.  The
   attribute is used to negotiate the BFCP version.

   The Augmented BNF syntax [RFC5234] for the attributes is:















Camarillo, et al.        Expires March 30, 2019                 [Page 8]

Internet-Draft                    BFCP                    September 2018


         Attribute Name: bfcpver

         Attribute Value: bfcp-version

         Usage Level: media

         Charset Dependent: No

         Mux Category: TBD

       The Augmented BNF syntax [RFC5234] for the attribute is:

         bfcp-version = "a=bfcpver:" version *(SP version)
         version      = 1*DIGIT

         ;DIGIT is defined in [RFC5234]

   An endpoint uses the 'bfcpver' attribute to convey the version(s) of
   BFCP supported by the endpoint, using integer values.  For a given
   version, the attribute value representing the version MUST match the
   "Version" field that would be presented in the BFCP COMMON-HEADER
   [I-D.ietf-bfcpbis-rfc4582bis].  The BFCP version that will eventually
   be used will be conveyed with a BFCP-level Hello/HelloAck.

   Endpoints compliant with [RFC4583] might not always include the
   'bfcpver' attribute in offers and answers.  The attribute value, if
   present, MUST be in accordance with the definition of the Version
   field in [I-D.ietf-bfcpbis-rfc4582bis].  If the attribute is not
   present, endpoints MUST assume a default value in accordance with
   [I-D.ietf-bfcpbis-rfc4582bis]: when used over a reliable transport
   the default attribute value is "1", and when used over an unreliable
   transport the default attribute value is "2".  The value is inferred
   from the transport specified in the 'm' line (Section 4) associated
   with the stream.

   The SDP Offer/Answer procedures for the 'bfcpver' attribute are
   defined in Section 10.

6.  Multiplexing Considerations

   [I-D.ietf-mmusic-sdp-bundle-negotiation] defines how multiplexing of
   multiple media streams can be negotiated.  This specification does
   not define how BFCP streams can be multiplexed with other media
   streams.  Therefore, a BFCP stream MUST NOT be associated with a
   BUNDLE group [I-D.ietf-mmusic-sdp-bundle-negotiation].  Note that
   BFCP-controlled media streams might be multiplexed with other media
   streams.




Camarillo, et al.        Expires March 30, 2019                 [Page 9]

Internet-Draft                    BFCP                    September 2018


   [I-D.ietf-mmusic-sdp-mux-attributes] defines the mux categories for
   the SDP attributes defined in this specification.  Table 2 defines
   the mux category for the 'bfcpver' attribute:

   +---------+-------------------------------------+-------+-----------+
   | Name    | Notes                               | Level | Mux       |
   |         |                                     |       | Category  |
   +---------+-------------------------------------+-------+-----------+
   | bfcpver | Needs further analysis in a         | M     | TBD       |
   |         | separate specification              |       |           |
   +---------+-------------------------------------+-------+-----------+

                 Table 2: Multiplexing Attribute Analysis

7.  BFCP Connection Management

   BFCP streams can use TCP or UDP as the underlying transport.
   Endpoints exchanging BFCP messages over UDP send the BFCP messages
   towards the peer using the connection address and port provided in
   the SDP 'c' and 'm' lines.  TCP connection management is more
   complicated and is described in the following Section.

      Note: When using Interactive Connectivity Establishment (ICE)
      [RFC8445], TCP/DTLS/BFCP, and UDP/TLS/BFCP, the straight-forward
      procedures for connection management as UDP/BFCP described above
      apply.  TCP/TLS/BFCP follows the same procedures as TCP/BFCP and
      is described below.

7.1.  TCP Connection Management

   The management of the TCP connection used to transport BFCP messages
   is performed using the SDP 'setup' and 'connection' attributes
   [RFC4145].  The 'setup' attribute indicates which of the endpoints
   initiates the TCP connection.  The 'connection' attribute handles TCP
   connection re-establishment.

   The BFCP specification [I-D.ietf-bfcpbis-rfc4582bis] describes a
   number of situations when the TCP connection between a floor control
   client and the floor control server needs to be re-established.
   However, that specification does not describe the re-establishment
   process because this process depends on how the connection was
   established in the first place.  Endpoints using the offer/answer
   mechanism follow the following rules.

   When the existing TCP connection is closed and re-established
   following the rules in [I-D.ietf-bfcpbis-rfc4582bis], the floor
   control client MUST send an offer towards the floor control server in
   order to re-establish the connection.  If a TCP connection cannot



Camarillo, et al.        Expires March 30, 2019                [Page 10]

Internet-Draft                    BFCP                    September 2018


   deliver a BFCP message and times out, the endpoint that attempted to
   send the message (i.e., the one that detected the TCP timeout) MUST
   send an offer in order to re-establish the TCP connection.

   Endpoints that use the offer/answer mechanism to negotiate TCP
   connections MUST support the 'setup' and 'connection' attributes.

8.  TLS/DTLS Considerations

   When DTLS is used with UDP, the generic procedures defined in
   Section 5 of [I-D.ietf-mmusic-dtls-sdp] MUST be followed.

   When TLS is used with TCP, once the underlying connection is
   established, the answerer always acts as the TLS server.  If the TCP
   connection is lost, the active endpoint is responsible for re-
   establishing the TCP connection.  Unless a new TLS session is
   negotiated, subsequent SDP offers and answers will not impact the
   previously negotiated TLS roles.

      Note: For TLS, it was decided to keep the original procedures in
      [RFC4583] to determine which endpoint acts as the TLS server in
      order to retain backwards compatibility.

9.  ICE Considerations

   Generic SDP offer/answer procedures for Interactive Connectivity
   Establishment (ICE) are defined in [I-D.ietf-mmusic-ice-sip-sdp].

   When BFCP is used with UDP based ICE candidates [RFC8445] then the
   procedures for UDP/TLS/BFCP are used.

   When BFCP is used with TCP based ICE candidates [RFC6544] then the
   procedures for TCP/DTLS/BFCP are used.

   Based on the procedures defined in [I-D.ietf-mmusic-dtls-sdp],
   endpoints treat all ICE candidate pairs associated with a BFCP stream
   on top of a DTLS association as part of the same DTLS association.
   Thus, there will only be one BFCP handshake and one DTLS handshake
   even if there are multiple valid candidate pairs, and if BFCP media
   is shifted between candidate pairs (including switching between UDP
   to TCP candidate pairs) prior to nomination.  If new candidates are
   added, they will also be part of the same DTLS association.

   In order to maximize the likelihood of interoperability between the
   endpoints, all ICE enabled BFCP-over-DTLS endpoints SHOULD implement
   support for UDP/TLS/BFCP.





Camarillo, et al.        Expires March 30, 2019                [Page 11]

Internet-Draft                    BFCP                    September 2018


   When an SDP offer or answer conveys multiple ICE candidates for a
   BFCP stream, UDP based candidates SHOULD be included and the default
   candidate SHOULD be chosen from one of those UDP candidates.  If UDP
   transport is used for the default candidate, then the 'm' line proto
   value MUST be 'UDP/TLS/BFCP'.  If TCP transport is used for the
   default candidate, the 'm' line proto value MUST be 'TCP/DTLS/BFCP'.

      Note: Usage of ICE with protocols other than UDP/TLS/BFCP and
      TCP/DTLS/BFCP is outside of scope for this specification.

10.  SDP Offer/Answer Procedures

   This section defines the SDP offer/answer [RFC3264] procedures for
   negotiating and establishing a BFCP stream.  Generic procedures for
   DTLS are defined in [I-D.ietf-mmusic-dtls-sdp].  Generic procedures
   for TLS are defined in [RFC8122].

   This section only defines the BFCP-specific procedures.  Unless
   explicitly stated otherwise, the procedures apply to an 'm' line
   describing a BFCP stream.  If an offer or answer contains multiple
   'm' lines describing BFCP streams, the procedures are applied
   independently to each stream.

   Within this document, 'initial offer' refers to the first offer,
   within an SDP session (e.g. a SIP dialog when the Session Initiation
   Protocol (SIP) [RFC3261] is used to carry SDP), in which the offerer
   indicates that it wants to negotiate the establishment of a BFCP
   stream.

   If the 'm' line 'proto' value is 'TCP/TLS/BFCP', 'TCP/DTLS/BFCP' or
   'UDP/TLS/BFCP', the offerer and answerer follow the generic
   procedures defined in [RFC8122].

   If the 'm' line proto value is 'TCP/BFCP', 'TCP/TLS/BFCP', 'TCP/DTLS/
   TCP' or 'UDP/TLS/BFCP', the offerer and answerer use the SDP 'setup'
   attribute according to the procedures in [RFC4145].

   If the 'm' line proto value is 'TCP/BFCP', 'TCP/TLS/BFCP' or
   'TCP/DTLS/BFCP', the offerer and anwerer use the SDP 'connection'
   attribute according to the procedures in [RFC4145].

      Note: The use of source-specific SDP parameters [RFC5576] is not
      defined for BFCP streams.








Camarillo, et al.        Expires March 30, 2019                [Page 12]

Internet-Draft                    BFCP                    September 2018


10.1.  Generating the Initial SDP Offer

   When the offerer creates an initial offer, the offerer MUST associate
   an SDP 'floorctrl' attribute (Section 5.1) and an SDP 'bfcpver'
   attribute (Section 5.4) with the 'm' line.

   In addition, if the offerer includes an SDP 'floorctrl' attribute
   with 's-only' or 'c-s' attribute values in the offer, the offerer:

   o  MUST associate an SDP 'confid' attribute (Section 5.2) with the
      'm' line; and

   o  MUST associate an SDP 'userid' attribute (Section 5.2) with the
      'm' line; and

   o  MUST associate an SDP 'floorid' attribute (Section 5.3) with the
      'm' line; and

   o  MUST associate an SDP 'label' attribute ([RFC4574]) with the 'm'
      line of each BFCP-controlled media stream.

      Note: If the offerer includes an SDP 'floorctrl' attribute with a
      'c-s' attribute value, or both a 'c-only' and a 's-only' attribute
      value, in the offer, the attribute values above will only be used
      if it is determined (Section 5.1) that the offerer will act as
      floor control server.

10.2.  Generating the SDP Answer

   When the answerer receives an offer that contains an 'm' line
   describing a BFCP stream, the answerer MUST check whether it supports
   one or more of the BFCP versions supported by the offerer
   (Section 5.4).  If the answerer does not support any of the BFCP
   versions, it MUST NOT accept the 'm' line.  Otherwise, if the
   answerer accepts the 'm' line, it:

   o  MUST insert a corresponding 'm' line in the answer, with an
      identical 'm' line proto value [RFC3264]; and

   o  MUST associate a 'bfcpver' attribute with the 'm' line.  The
      answerer only indicates support of BFCP versions also supported by
      the offerer; and

   o  MUST, if the offer contained an SDP 'floorctrl' attribute,
      associate a 'floorctrl' attribute with the 'm' line.

   In addition, if the answerer includes an SDP 'floorctrl' attribute
   with an 's-only' attribute value in the answer, the answerer:



Camarillo, et al.        Expires March 30, 2019                [Page 13]

Internet-Draft                    BFCP                    September 2018


   o  MUST associate an SDP 'confid' attribute with the 'm' line; and

   o  MUST associate an SDP 'userid' attribute with the 'm' line; and

   o  MUST associate an SDP 'floorid' attribute with the 'm' line; and

   o  MUST associate an SDP 'label' attribute with the 'm' line of each
      BFCP-controlled media stream.

      Note: An offerer compliant with [RFC4583] might not include
      'floorctrl' and 'bfcpver' attributes in offers, in which cases the
      default values apply.

   Once the answerer has sent the answer, the answerer:

   o  MUST, if the answerer is the 'active' endpoint, and if a TCP
      connection associated with the 'm' line is to be established (or
      re-established), initiate the establishing of the TCP connection;
      and

   o  MUST, if the answerer is the 'active' endpoint, and if an TLS/DTLS
      connection associated with the 'm' line is to be established (or
      re-established), initiate the establishing of the TLS/DTLS
      connection (by sending a ClientHello message).

   If the answerer does not accept the 'm' line in the offer, it MUST
   assign a zero port value to the corresponding 'm' line in the answer.
   In addition, the answerer MUST NOT establish a TCP connection or a
   TLS/DTLS connection associated with the 'm' line.

10.3.  Offerer Processing of the SDP Answer

   When the offerer receives an answer, which contains an 'm' line with
   a non-zero port value, describing a BFCP stream, the offerer:

   o  MUST, if the offerer is the 'active' endpoint, and if a TCP
      connection associated with the 'm' line is to be established (or
      re-established), initiate the establishing of the TCP connection;
      and

   o  MUST, if the offerer is the 'active' endpoint, and if an TLS/DTLS
      connection associated with the 'm' line is to be established (or
      re-established), initiate the establishing of the TLS/DTLS
      connection (by sending a ClientHello message).

      Note: An answerer compliant with [RFC4583] might not include
      'floorctrl' and 'bfcpver' attributes in answers, in which cases
      the default values apply.



Camarillo, et al.        Expires March 30, 2019                [Page 14]

Internet-Draft                    BFCP                    September 2018


   If the 'm' line in the answer contains a zero port value, or if the
   offerer for some other reason does not accept the answer (e.g., if
   the answerer only indicates support of BFCP versions not supported by
   the offerer), the offerer MUST NOT establish a TCP connection or a
   TLS/DTLS connection associated with the 'm' line.

10.4.  Modifying the Session

   When an offerer sends an updated offer, in order to modify a
   previously established BFCP stream, it follows the procedures in
   Section 10.1, with the following exceptions:

   o  If the BFCP stream is carried on top of TCP, and if the offerer
      does not want to re-establish an existing TCP connection, the
      offerer MUST associate an SDP 'connection' attribute with a value
      of "existing", with the 'm' line; and

   o  If the offerer wants to disable a previously established BFCP
      stream, it MUST assign a zero port value to the 'm' line
      associated with the BFCP connection, following the procedures in
      [RFC3264].

11.  Examples

   For the purpose of brevity, the main portion of the session
   description is omitted in the examples, which only show 'm' lines and
   their attributes.

   The following is an example of an offer sent by a conference server
   to a client.

   m=application 50000 TCP/TLS/BFCP *
   a=setup:actpass
   a=connection:new
   a=fingerprint:sha-256 \
        19:E2:1C:3B:4B:9F:81:E6:B8:5C:F4:A5:A8:D8:73:04: \
        BB:05:2F:70:9F:04:A9:0E:05:E9:26:33:E8:70:88:A2
   a=floorctrl:c-only s-only
   a=confid:4321
   a=userid:1234
   a=floorid:1 mstrm:10
   a=floorid:2 mstrm:11
   a=bfcpver:1 2
   m=audio 50002 RTP/AVP 0
   a=label:10
   m=video 50004 RTP/AVP 31
   a=label:11




Camarillo, et al.        Expires March 30, 2019                [Page 15]

Internet-Draft                    BFCP                    September 2018


   Note that due to RFC formatting conventions, this document splits SDP
   across lines whose content would exceed 72 characters.  A backslash
   character marks where this line folding has taken place.  This
   backslash and its trailing CRLF and whitespace would not appear in
   actual SDP content.

   The following is the answer returned by the client.

   m=application 9 TCP/TLS/BFCP *
   a=setup:active
   a=connection:new
   a=fingerprint:sha-256 \
        6B:8B:F0:65:5F:78:E2:51:3B:AC:6F:F3:3F:46:1B:35: \
        DC:B8:5F:64:1A:24:C2:43:F0:A1:58:D0:A1:2C:19:08
   a=floorctrl:c-only
   a=bfcpver:1
   m=audio 55000 RTP/AVP 0
   m=video 55002 RTP/AVP 31

   A similar example using unreliable transport and DTLS is shown below,
   where the offer is sent from a client.

   m=application 50000 UDP/TLS/BFCP *
   a=setup:actpass
   a=dtls-id:abc3dl
   a=fingerprint:sha-256 \
        19:E2:1C:3B:4B:9F:81:E6:B8:5C:F4:A5:A8:D8:73:04: \
        BB:05:2F:70:9F:04:A9:0E:05:E9:26:33:E8:70:88:A2
   a=floorctrl:c-only s-only
   a=confid:4321
   a=userid:1234
   a=floorid:1 mstrm:10
   a=floorid:2 mstrm:11
   a=bfcpver:1 2
   m=audio 50002 RTP/AVP 0
   a=label:10
   m=video 50004 RTP/AVP 31
   a=label:11

   The following is the answer returned by the server.











Camarillo, et al.        Expires March 30, 2019                [Page 16]

Internet-Draft                    BFCP                    September 2018


   m=application 55000 UDP/TLS/BFCP *
   a=setup:active
   a=dtls-id:abc3dl
   a=fingerprint:sha-256 \
        6B:8B:F0:65:5F:78:E2:51:3B:AC:6F:F3:3F:46:1B:35: \
        DC:B8:5F:64:1A:24:C2:43:F0:A1:58:D0:A1:2C:19:08
   a=floorctrl:s-only
   a=confid:4321
   a=userid:1234
   a=floorid:1 mstrm:10
   a=floorid:2 mstrm:11
   a=bfcpver:2
   m=audio 55002 RTP/AVP 0
   m=video 55004 RTP/AVP 31

12.  Security Considerations

   The BFCP [I-D.ietf-bfcpbis-rfc4582bis], SDP [RFC4566], and offer/
   answer [RFC3264] specifications discuss security issues related to
   BFCP, SDP, and offer/answer, respectively.  In addition, [RFC4145]
   and [RFC8122] discuss security issues related to the establishment of
   TCP and TLS connections using an offer/answer model.  Furthermore,
   when using DTLS over UDP, the generic offer/answer considerations
   defined in [I-D.ietf-mmusic-dtls-sdp] MUST be followed.

13.  IANA Considerations

      [Editorial note: The changes in Section 13.1 instruct the IANA to
      register the three new values TCP/DTLS/BFCP, UDP/BFCP and UDP/TLS/
      BFCP for the SDP 'proto' field.  The new section Section 5.4
      registers a new SDP "bfcpver" attribute.  The rest is unchanged
      from [RFC4582].]

13.1.  Registration of SDP 'proto' Values

   The IANA has registered the following values for the SDP 'proto'
   field under the Session Description Protocol (SDP) Parameters
   registry:













Camarillo, et al.        Expires March 30, 2019                [Page 17]

Internet-Draft                    BFCP                    September 2018


                      +---------------+------------+
                      | Value         | Reference  |
                      +---------------+------------+
                      | TCP/BFCP      | [RFC XXXX] |
                      | TCP/DTLS/BFCP | [RFC XXXX] |
                      | TCP/TLS/BFCP  | [RFC XXXX] |
                      | UDP/BFCP      | [RFC XXXX] |
                      | UDP/TLS/BFCP  | [RFC XXXX] |
                      +---------------+------------+

                 Table 3: Values for the SDP 'proto' field

13.2.  Registration of the SDP 'floorctrl' Attribute

   This document defines the SDP attribute,'floorctrl'.  The details of
   the attribute are defined in Section 5.1.

   For issues regarding this attribute contact iesg@ietf.org.

13.3.  Registration of the SDP 'confid' Attribute

   This document defines the SDP attribute,'confid'.  The details of the
   attribute are defined in Section 5.2.

   For issues regarding this attribute contact iesg@ietf.org.

13.4.  Registration of the SDP 'userid' Attribute

   This document defines the SDP attribute,'userid'.  The details of the
   attribute are defined in Section 5.2.

   For issues regarding this attribute contact iesg@ietf.org.

13.5.  Registration of the SDP 'floorid' Attribute

   This document defines the SDP attribute,'floorid'.  The details of
   the attribute are defined in Section 5.3.

   For issues regarding this attribute contact iesg@ietf.org.

13.6.  Registration of the SDP 'bfcpver' Attribute

   This document defines the SDP attribute,'bfcpver'.  The details of
   the attribute are defined in Section 5.4.

   For issues regarding this attribute contact iesg@ietf.org.





Camarillo, et al.        Expires March 30, 2019                [Page 18]

Internet-Draft                    BFCP                    September 2018


14.  Changes from RFC 4583

   Following is the list of technical changes and other fixes from
   [RFC4583].

   Main purpose of this work was to add signaling support necessary to
   support BFCP over unreliable transport, as described in
   [I-D.ietf-bfcpbis-rfc4582bis], resulting in the following changes:

   1.  Fields in the 'm' line (Section 4):
       The section is re-written to remove reference to the exclusivity
       of TCP as a transport for BFCP streams.  The proto field values
       TCP/DTLS/BFCP, UDP/BFCP and UDP/TLS/BFCP added.

   2.  Authentication (Section 8):
       In last paragraph, made clear that a TCP connection was
       described.

   3.  Security Considerations (Section 12):
       For the DTLS over UDP case, mention existing considerations and
       requirements for the offer/answer exchange in
       [I-D.ietf-mmusic-dtls-sdp].

   4.  Registration of SDP 'proto' Values (Section 13.1):
       Register the three new values TCP/DTLS/BFCP, UDP/BFCP and
       UDP/TLS/BFCP in the SDP parameters registry.

   5.  BFCP Version Negotiation (Section 5.4):
       A new 'bfcpver' SDP media-level attribute is added in order to
       signal supported version number.

   In addition to the changes associated with support BFCP over
   unreliable transport, the possibility for an endpoint to act as both
   floor control client and floor control server at the same time has
   been removed.  An endpoint will now take the same role for all BFCP-
   controlled streams associated with the BFCP stream.

   Clarification and bug fixes:

   1.  Errata ID: 712 (Section 3 and Section 10):
       Language clarification.  Don't use terms like an SDP attribute is
       "used in an 'm' line", instead make clear that the attribute is a
       media-level attribute.

   2.  Fix typo in example (Section 11):
       Do not use 'm-stream' in the SDP example, use the correct 'mstrm'
       as specified in Section 11.  Recommend interpreting 'm-stream' if
       it is received, since it is present in some implementations.



Camarillo, et al.        Expires March 30, 2019                [Page 19]

Internet-Draft                    BFCP                    September 2018


   3.  Assorted clarifications (Across the document):
       Language clarifications as a result of reviews.  Also, the
       normative language where tightened where appropriate, i.e.
       changed from SHOULD strength to MUST in a number of places.

15.  Acknowledgements

   Joerg Ott, Keith Drage, Alan Johnston, Eric Rescorla, Roni Even, and
   Oscar Novo provided useful ideas for the original [RFC4583].  The
   authors also acknowledge contributions to the revision of BFCP for
   use over an unreliable transport from Geir Arne Sandbakken, Charles
   Eckel, Alan Ford, Eoin McLeod and Mark Thompson.  Useful and
   important final reviews were done by Ali C.  Begen, Mary Barnes and
   Charles Eckel.  In the final stages, Roman Shpount made a
   considerable effort in adding proper ICE support and considerations.

16.  References

16.1.  Normative References

   [I-D.ietf-bfcpbis-rfc4582bis]
              Camarillo, G., Drage, K., Kristensen, T., Ott, J., and C.
              Eckel, "The Binary Floor Control Protocol (BFCP)", draft-
              ietf-bfcpbis-rfc4582bis-16 (work in progress), November
              2015.

   [I-D.ietf-mmusic-dtls-sdp]
              Holmberg, C. and R. Shpount, "Session Description Protocol
              (SDP) Offer/Answer Considerations for Datagram Transport
              Layer Security (DTLS) and Transport Layer Security (TLS)",
              draft-ietf-mmusic-dtls-sdp-32 (work in progress), October
              2017.

   [I-D.ietf-mmusic-ice-sip-sdp]
              Petit-Huguenin, M., Nandakumar, S., and A. Keranen,
              "Session Description Protocol (SDP) Offer/Answer
              procedures for Interactive Connectivity Establishment
              (ICE)", draft-ietf-mmusic-ice-sip-sdp-21 (work in
              progress), June 2018.

   [RFC2119]  Bradner, S., "Key words for use in RFCs to Indicate
              Requirement Levels", BCP 14, RFC 2119,
              DOI 10.17487/RFC2119, March 1997, <https://www.rfc-
              editor.org/info/rfc2119>.







Camarillo, et al.        Expires March 30, 2019                [Page 20]

Internet-Draft                    BFCP                    September 2018


   [RFC3261]  Rosenberg, J., Schulzrinne, H., Camarillo, G., Johnston,
              A., Peterson, J., Sparks, R., Handley, M., and E.
              Schooler, "SIP: Session Initiation Protocol", RFC 3261,
              DOI 10.17487/RFC3261, June 2002, <https://www.rfc-
              editor.org/info/rfc3261>.

   [RFC3264]  Rosenberg, J. and H. Schulzrinne, "An Offer/Answer Model
              with Session Description Protocol (SDP)", RFC 3264,
              DOI 10.17487/RFC3264, June 2002, <https://www.rfc-
              editor.org/info/rfc3264>.

   [RFC4145]  Yon, D. and G. Camarillo, "TCP-Based Media Transport in
              the Session Description Protocol (SDP)", RFC 4145,
              DOI 10.17487/RFC4145, September 2005, <https://www.rfc-
              editor.org/info/rfc4145>.

   [RFC4566]  Handley, M., Jacobson, V., and C. Perkins, "SDP: Session
              Description Protocol", RFC 4566, DOI 10.17487/RFC4566,
              July 2006, <https://www.rfc-editor.org/info/rfc4566>.

   [RFC4571]  Lazzaro, J., "Framing Real-time Transport Protocol (RTP)
              and RTP Control Protocol (RTCP) Packets over Connection-
              Oriented Transport", RFC 4571, DOI 10.17487/RFC4571, July
              2006, <https://www.rfc-editor.org/info/rfc4571>.

   [RFC4574]  Levin, O. and G. Camarillo, "The Session Description
              Protocol (SDP) Label Attribute", RFC 4574,
              DOI 10.17487/RFC4574, August 2006, <https://www.rfc-
              editor.org/info/rfc4574>.

   [RFC4582]  Camarillo, G., Ott, J., and K. Drage, "The Binary Floor
              Control Protocol (BFCP)", RFC 4582, DOI 10.17487/RFC4582,
              November 2006, <https://www.rfc-editor.org/info/rfc4582>.

   [RFC4583]  Camarillo, G., "Session Description Protocol (SDP) Format
              for Binary Floor Control Protocol (BFCP) Streams",
              RFC 4583, DOI 10.17487/RFC4583, November 2006,
              <https://www.rfc-editor.org/info/rfc4583>.

   [RFC5234]  Crocker, D., Ed. and P. Overell, "Augmented BNF for Syntax
              Specifications: ABNF", STD 68, RFC 5234,
              DOI 10.17487/RFC5234, January 2008, <https://www.rfc-
              editor.org/info/rfc5234>.

   [RFC6347]  Rescorla, E. and N. Modadugu, "Datagram Transport Layer
              Security Version 1.2", RFC 6347, DOI 10.17487/RFC6347,
              January 2012, <https://www.rfc-editor.org/info/rfc6347>.




Camarillo, et al.        Expires March 30, 2019                [Page 21]

Internet-Draft                    BFCP                    September 2018


   [RFC6544]  Rosenberg, J., Keranen, A., Lowekamp, B., and A. Roach,
              "TCP Candidates with Interactive Connectivity
              Establishment (ICE)", RFC 6544, DOI 10.17487/RFC6544,
              March 2012, <https://www.rfc-editor.org/info/rfc6544>.

   [RFC8122]  Lennox, J. and C. Holmberg, "Connection-Oriented Media
              Transport over the Transport Layer Security (TLS) Protocol
              in the Session Description Protocol (SDP)", RFC 8122,
              DOI 10.17487/RFC8122, March 2017, <https://www.rfc-
              editor.org/info/rfc8122>.

   [RFC8174]  Leiba, B., "Ambiguity of Uppercase vs Lowercase in RFC
              2119 Key Words", BCP 14, RFC 8174, DOI 10.17487/RFC8174,
              May 2017, <https://www.rfc-editor.org/info/rfc8174>.

   [RFC8445]  Keranen, A., Holmberg, C., and J. Rosenberg, "Interactive
              Connectivity Establishment (ICE): A Protocol for Network
              Address Translator (NAT) Traversal", RFC 8445,
              DOI 10.17487/RFC8445, July 2018, <https://www.rfc-
              editor.org/info/rfc8445>.

16.2.  Informational References

   [I-D.ietf-mmusic-sdp-bundle-negotiation]
              Holmberg, C., Alvestrand, H., and C. Jennings,
              "Negotiating Media Multiplexing Using the Session
              Description Protocol (SDP)", draft-ietf-mmusic-sdp-bundle-
              negotiation-53 (work in progress), September 2018.

   [I-D.ietf-mmusic-sdp-mux-attributes]
              Nandakumar, S., "A Framework for SDP Attributes when
              Multiplexing", draft-ietf-mmusic-sdp-mux-attributes-17
              (work in progress), February 2018.

   [RFC5576]  Lennox, J., Ott, J., and T. Schierl, "Source-Specific
              Media Attributes in the Session Description Protocol
              (SDP)", RFC 5576, DOI 10.17487/RFC5576, June 2009,
              <https://www.rfc-editor.org/info/rfc5576>.

Authors' Addresses

   Gonzalo Camarillo
   Ericsson
   Hirsalantie 11
   FI-02420 Jorvas
   Finland

   Email: Gonzalo.Camarillo@ericsson.com



Camarillo, et al.        Expires March 30, 2019                [Page 22]

Internet-Draft                    BFCP                    September 2018


   Tom Kristensen
   Cisco
   Philip Pedersens vei 1
   NO-1366 Lysaker
   Norway

   Email: tomkrist@cisco.com, tomkri@ifi.uio.no


   Christer Holmberg
   Ericsson
   Hirsalantie 11
   Jorvas  02420
   Finland

   Email: christer.holmberg@ericsson.com



































Camarillo, et al.        Expires March 30, 2019                [Page 23]
